{
  "backend/main.mo": "Empty Motoko actor serving as the backend entry point with no implemented functionality.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (React SPA rebuild, shared Layout component, etc.) to their associated files, components, and test IDs with confidence ratings.",
  "frontend-file-summaries.txt": "JSON document providing one-sentence descriptions of each frontend source file, covering pages, components, hooks, utilities, and config.",
  "frontend/index.css": "Tailwind CSS base stylesheet defining OKLCH design tokens for light and dark themes, including colors for background, foreground, primary, chart, and sidebar variables.",
  "frontend/index.html": "Vite HTML entry point that mounts the React app into a #root div and loads the TypeScript module at /src/main.tsx.",
  "frontend/public/about.html": "Static HTML About page for Advocate Nishanth HC with navbar, hero section, bio content, and JSON-LD structured data; part of the legacy static site being replaced by the React SPA.",
  "frontend/public/appointment.html": "Static HTML Appointment page with a consultation booking form that submits via WhatsApp, including navbar, hero, and JSON-LD structured data for the legacy static site.",
  "frontend/public/cases.html": "Static HTML Cases page listing Advocate Nishanth HC's practice areas (civil, criminal, family law, etc.) with hero banner and JSON-LD structured data for the legacy static site.",
  "frontend/public/contact.html": "Static HTML contact page for Advocate Nishanth H C displaying phone, email, and office address cards with structured data (Schema.org), a navbar with language switcher, and a page hero section.",
  "frontend/public/index.html": "Static HTML homepage for Advocate Nishanth H C featuring a hero section, stats grid, service highlights, and Schema.org structured data for the legal service.",
  "frontend/public/styles.css": "Shared CSS stylesheet for the static HTML site defining CSS variables (gold/dark theme), reset rules, navbar, glassmorphism cards, hero sections, and responsive layout utilities.",
  "frontend/src/App.tsx": "React app entry point that configures TanStack Router with routes for Home, About, Cases, Appointment, and Contact pages under a shared Layout root route.",
  "frontend/src/components/Footer.tsx": "React footer component rendering brand info, quick navigation links, and contact details (address, phone, email) with a copyright line and a Caffeine.ai attribution link.",
  "frontend/src/components/Layout.tsx": "React layout wrapper that composes the Navbar, page Outlet, Footer, and a floating WhatsApp button into a full-height flex column.",
  "frontend/src/components/Navbar.tsx": "React navbar with scroll-aware background, active-route highlighting, a desktop link bar with a 'Book Now' CTA, and a collapsible mobile menu.",
  "frontend/src/components/SEO.tsx": "Headless React component that imperatively updates document title, meta tags (description, keywords, Open Graph), and a JSON-LD script tag based on passed props.",
  "frontend/src/components/WhatsAppFloat.tsx": "Renders a fixed floating WhatsApp button in the bottom-right corner with a pulse animation that links to a specific WhatsApp number.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor using React Query, supporting both authenticated and anonymous identities, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useCountUp.ts": "Custom hook that animates a number counting up from 0 to a target value over a given duration, triggered when a visibility flag becomes true.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider using DFINITY's AuthClient, exposing login, logout, and identity state to child components.",
  "frontend/src/hooks/useScrollReveal.ts": "Custom hook that uses IntersectionObserver to return a boolean indicating when a referenced element has scrolled into view, disconnecting after first reveal.",
  "frontend/src/index.css": "Global stylesheet that imports Google Fonts, configures Tailwind layers, and defines CSS custom properties and utility classes for the site's dark gold-themed design system.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with React Query and Internet Identity providers wrapping the root App component.",
  "frontend/src/pages/About.tsx": "About page for Advocate Nishanth H C featuring a hero banner, bio section with images, practice areas, and contact info, with scroll-reveal animations and SEO metadata.",
  "frontend/src/pages/Appointment.tsx": "Appointment booking page with a validated form that composes a WhatsApp message and opens a chat with Advocate Nishanth H C upon submission.",
  "frontend/src/pages/Cases.tsx": "Displays a legal services page for Advocate Nishanth H C with five service cards (Civil, Criminal, Family, Property, Documentation) featuring 3D tilt effects, scroll reveal animations, a hero section, and a CTA linking to the appointment page.",
  "frontend/src/pages/Contact.tsx": "Renders the contact page with phone, email, WhatsApp, and office address info cards, a Google Maps embed, and JSON-LD structured data for the legal service, with scroll reveal animations throughout.",
  "frontend/src/pages/Home.tsx": "Home page featuring a full-screen hero with CTA buttons, animated stat counters, a services grid with 3D tilt cards, a language switcher (EN/Kannada/Hindi) persisted to localStorage, and SEO/JSON-LD metadata.",
  "frontend/src/utils/translations.ts": "Defines UI string translations for English, Kannada, and Hindi used by the language switcher, covering hero text, service names/descriptions, stats labels, and button labels.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the theme with custom gold/dark site colors, Playfair Display and Inter fonts, gold-glow box shadow, WhatsApp pulse animation, and plugins for typography, container queries, and animate.",
  "project_state.json": "Tracks the project state (version 7) for a 5-page React/TypeScript advocate website, documenting architectural decisions, existing features, known issues, and rebuild rationale (fixing blank white screen in static HTML version)."
}