{
  "backend/main.mo": "Empty Motoko actor serving as the backend entry point with no implemented functionality.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (hero image URL fix, service card navigation, scroll-to-top behavior) to their source files, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "JSON map of all frontend source files to short descriptions summarizing each file's purpose, styling tokens, and key behaviors.",
  "frontend/index.css": "Global Tailwind CSS entry file defining OKLCH-based CSS custom properties for light and dark themes including colors, borders, charts, and sidebar tokens.",
  "frontend/index.html": "Root HTML shell for the React app, setting the page title to 'Nishanth HC Advocate Website' and mounting the app via /src/main.tsx.",
  "frontend/public/about.html": "Static HTML About page for Advocate Nishanth H C with SEO meta tags, JSON-LD structured data, navbar, hero section, and bio content with i18n data attributes.",
  "frontend/public/appointment.html": "Static HTML Appointment page with SEO meta tags, JSON-LD structured data, a consultation booking form that submits via WhatsApp, and multilingual support.",
  "frontend/public/cases.html": "Static HTML Cases/Services page with SEO meta tags, a hero section using the cases background image URL, and detailed sections for each legal practice area with i18n support.",
  "frontend/public/contact.html": "Static HTML contact page for Advocate Nishanth H C, displaying phone, email, and office address cards with structured data (JSON-LD), a navbar with language switcher, and a page hero section.",
  "frontend/public/index.html": "Static HTML homepage for Advocate Nishanth H C featuring a hero section, stats grid, service highlights, and structured data markup for SEO, with a shared navbar and language switcher.",
  "frontend/public/styles.css": "Shared CSS stylesheet for the static HTML site, defining CSS variables (gold/dark theme), reset rules, navbar, glassmorphism cards, hero sections, buttons, and responsive layout utilities.",
  "frontend/src/App.tsx": "React app entry point that configures TanStack Router with routes for Home, About, Cases, Appointment, and Contact pages, and includes a ScrollToTop component on route change.",
  "frontend/src/components/Footer.tsx": "React Footer component rendering the site logo, quick navigation links, and contact details (address, phone, email) using TanStack Router's Link and Lucide icons.",
  "frontend/src/components/Layout.tsx": "React Layout wrapper that composes Navbar, Footer, WhatsAppFloat, and a router Outlet into a full-page flex column structure.",
  "frontend/src/components/Navbar.tsx": "React Navbar component with sticky positioning, scroll-shadow effect, active-link highlighting, a mobile hamburger menu, and a prominent 'Book Appointment' CTA button.",
  "frontend/src/components/SEO.tsx": "Headless React component that imperatively sets document title, meta tags (description, keywords, Open Graph), and a JSON-LD script tag based on passed props.",
  "frontend/src/components/WhatsAppFloat.tsx": "Renders a fixed floating WhatsApp button in the bottom-right corner with a pulse animation and hover effects, linking to a specific WhatsApp number.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor using React Query, returning either an authenticated or anonymous actor based on the current Internet Identity, and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useCountUp.ts": "Custom hook that animates a number counting up from 0 to a target value over a given duration, starting only when the element becomes visible.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider using DFINITY's AuthClient, exposing login/logout functions, identity state, and login status to child components.",
  "frontend/src/hooks/useScrollReveal.ts": "Custom hook that uses IntersectionObserver to return a boolean indicating whether a referenced element has entered the viewport, triggering once and then disconnecting.",
  "frontend/src/index.css": "Global stylesheet that imports Google Fonts, configures Tailwind base/components/utilities, and defines CSS custom properties and utility classes for the site's gold, dark, and WhatsApp color themes.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with React Query and InternetIdentityProvider wrappers around the root App component.",
  "frontend/src/pages/About.tsx": "About page for Advocate Nishanth H C featuring scroll-reveal animations, a bio section with images and practice areas, a quote section, and structured JSON-LD SEO metadata.",
  "frontend/src/pages/Appointment.tsx": "Appointment booking page with a validated form that composes a pre-filled WhatsApp message and opens it in a new tab, alongside contact info and JSON-LD SEO metadata.",
  "frontend/src/pages/Cases.tsx": "Renders the Cases & Services page with a hero banner, five interactive 3D-tilt service cards (Civil, Criminal, Family, Property, Documentation), SEO metadata, and JSON-LD structured data; clicking any card navigates to the appointment page.",
  "frontend/src/pages/Contact.tsx": "Renders the Contact page with a hero banner, three contact cards (Phone, Email, WhatsApp), an embedded Google Map, and SEO/JSON-LD with the office address; uses scroll-reveal animations throughout.",
  "frontend/src/pages/Home.tsx": "Renders the Home page with a full-screen hero, language switcher (EN/Kannada/Hindi) persisted to localStorage, animated stat counters, and 3D-tilt service cards that navigate to the appointment page.",
  "frontend/src/utils/translations.ts": "Exports a translations record keyed by language ('en', 'kn', 'hi') containing all UI strings used on the Home page, including hero text, stat labels, and service titles/descriptions.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom colors (gold, site palette, WhatsApp green), Playfair Display and Inter font families, custom shadows, and accordion/WhatsApp-pulse keyframe animations; includes typography, container-queries, and animate plugins.",
  "project_state.json": "Tracks project state (version 13) for the Advocate Nishanth H C website, documenting the architecture, theme decisions, feature list, known issues, and implementation notes for the React + TypeScript SPA."
}