{
  "kind": "build_request",
  "title": "Fix Cases hero image, service card navigation, and page scroll-to-top",
  "projectName": "Nishanth HC Advocate Website",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-38",
      "text": "In frontend/src/pages/Cases.tsx, fix the hero section background image URL https://i.postimg.cc/ncL4hcQ9/Whats_App_Image_2026_02_26_at_6_16_08_PM_(1).jpg so it renders correctly. Properly encode the parentheses in the URL (replace '(' with '%28' and ')' with '%29') when used in a CSS background-image or inline style. Ensure the image renders with object-fit: cover, includes descriptive alt text if used as an <img>, and does not have lazy-loading attributes that could prevent it from displaying in the hero section.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-11"
        ],
        "quotes": [
          "IMAGE NOT SHOWING FIX — Use this exact image URL and ensure it loads properly: https://i.postimg.cc/ncL4hcQ9/Whats_App_Image_2026_02_26_at_6_16_08_PM_(1).jpg",
          "If filename parentheses cause issue, properly encode URL.",
          "Place this image correctly in the Cases page section as intended."
        ]
      },
      "acceptanceCriteria": [
        "The Cases page hero section displays the background image visually without a broken/blank area.",
        "The URL used in the component has parentheses encoded as %28 and %29.",
        "The image covers the full hero area with object-fit: cover.",
        "No lazy-loading attribute is applied to the hero image element."
      ]
    },
    {
      "id": "REQ-39",
      "text": "In frontend/src/pages/Home.tsx (and frontend/src/pages/Cases.tsx if service cards appear there), add an onClick handler to all five service cards (Civil, Criminal, Family, Property, Documentation) that navigates to /appointment using the React Router navigate function and then calls window.scrollTo(0, 0) to land at the top of the Appointment page (which contains the booking form).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-11"
        ],
        "quotes": [
          "SERVICE CARDS CLICK ACTION — When user clicks any Service Card (Civil, Criminal, Family, Property, Documentation): Automatically redirect to appointment.html OR Smooth scroll to booking form section if on same page.",
          "Preferred behavior: Open appointment.html and auto-scroll to booking form."
        ]
      },
      "acceptanceCriteria": [
        "Clicking any of the five service cards (Civil, Criminal, Family, Property, Documentation) on the Home page navigates to the /appointment route.",
        "After navigation, the page is scrolled to the top (window.scrollTo(0, 0)) so the booking form is visible.",
        "All existing card styles, animations, and hover effects remain unchanged.",
        "The click area covers the entire card, not just text."
      ]
    },
    {
      "id": "REQ-40",
      "text": "Ensure every internal navigation action across the site forces a scroll-to-top. In frontend/src/App.tsx or a dedicated scroll-restoration component, call window.scrollTo(0, 0) on every route change using a router-level effect (e.g., listening to the router location/pathname). Additionally, ensure that the onClick handlers on navbar links, the 'Book Now' button, service card clicks, and any other programmatic navigation calls window.scrollTo(0, 0) either directly in the handler or via the router-level scroll restoration.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-11"
        ],
        "quotes": [
          "PAGE LOAD POSITION FIX — Currently pages are loading mid-scroll. Fix this: On every navigation click (Home, About, Cases, Appointment, Contact) Force page to start from TOP.",
          "Implement: window.scrollTo(0, 0);",
          "Apply to: Navbar clicks, Service card clicks, Any internal navigation"
        ]
      },
      "acceptanceCriteria": [
        "Navigating to any page via the navbar always starts the page at scroll position 0.",
        "Navigating via service card clicks starts the destination page at scroll position 0.",
        "Navigating via any CTA button (Book Appointment, Need Legal Help?, etc.) starts the destination page at scroll position 0.",
        "No page ever opens mid-scroll after a navigation action."
      ]
    }
  ],
  "constraints": [
    "Do not change the white premium theme (#ffffff, #f8f9fb backgrounds).",
    "Do not change button colors (green #25D366 for Book Appointment/WhatsApp buttons).",
    "Do not change scroll reveal animations or water-wave animation styles.",
    "Do not change the page layout or component structure beyond what is specified.",
    "Do not change the language switcher functionality.",
    "Do not change the WhatsApp float button or WhatsApp form submission logic.",
    "Do not edit any file under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or frontend/src/components/ui."
  ],
  "nonGoals": [
    "Adding new pages or sections.",
    "Changing the appointment form fields or WhatsApp message format.",
    "Modifying the navbar logo or footer branding.",
    "Updating SEO metadata or JSON-LD structured data.",
    "Changing card content, icons, or descriptions.",
    "Any backend changes."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}