{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix Cases hero image, service card navigation, and page scroll-to-top",
  "requirements": [
    {
      "id": "REQ-38",
      "summary": "Fix Cases page hero section background image by encoding parentheses in URL and ensuring proper rendering with object-fit cover",
      "acceptanceCriteria": [
        "The Cases page hero section displays the background image visually without a broken/blank area.",
        "The URL used in the component has parentheses encoded as %28 and %29.",
        "The image covers the full hero area with object-fit: cover.",
        "No lazy-loading attribute is applied to the hero image element."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Cases.tsx",
          "operation": "modify",
          "description": "In the hero section, replace the background image URL https://i.postimg.cc/ncL4hcQ9/Whats_App_Image_2026_02_26_at_6_16_08_PM_(1).jpg with the properly URL-encoded version https://i.postimg.cc/ncL4hcQ9/Whats_App_Image_2026_02_26_at_6_16_08_PM_%281%29.jpg (parentheses encoded as %28 and %29). Ensure the background-image style includes object-fit: cover and that no lazy-loading attributes are present on the hero image element."
        }
      ]
    },
    {
      "id": "REQ-39",
      "summary": "Add onClick navigation to all five service cards (Civil, Criminal, Family, Property, Documentation) that redirects to /appointment and scrolls to top",
      "acceptanceCriteria": [
        "Clicking any of the five service cards (Civil, Criminal, Family, Property, Documentation) on the Home page navigates to the /appointment route.",
        "After navigation, the page is scrolled to the top (window.scrollTo(0, 0)) so the booking form is visible.",
        "All existing card styles, animations, and hover effects remain unchanged.",
        "The click area covers the entire card, not just text."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Home.tsx",
          "operation": "modify",
          "description": "Import useNavigate from @tanstack/react-router. Add an onClick handler to all five service card container divs that calls navigate('/appointment') followed by window.scrollTo(0, 0). Ensure the entire card is clickable by applying cursor-pointer to the card container and preserving all existing hover effects, tilt animations, and styling."
        },
        {
          "path": "frontend/src/pages/Cases.tsx",
          "operation": "modify",
          "description": "Import useNavigate from @tanstack/react-router. Add an onClick handler to all five service card container divs (Civil, Criminal, Family, Property, Documentation) that calls navigate('/appointment') followed by window.scrollTo(0, 0). Ensure the entire card is clickable by applying cursor-pointer to the card container and preserving all existing hover effects, tilt animations, and styling."
        }
      ]
    },
    {
      "id": "REQ-40",
      "summary": "Implement global scroll-to-top on every route change and navigation action across the site",
      "acceptanceCriteria": [
        "Navigating to any page via the navbar always starts the page at scroll position 0.",
        "Navigating via service card clicks starts the destination page at scroll position 0.",
        "Navigating via any CTA button (Book Appointment, Need Legal Help?, etc.) starts the destination page at scroll position 0.",
        "No page ever opens mid-scroll after a navigation action."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add a useEffect hook that listens to router.state.location.pathname changes. Inside the effect, call window.scrollTo(0, 0) to force scroll-to-top on every route change. This ensures that all navigation actions (navbar, service cards, programmatic navigation) start the destination page at the top."
        },
        {
          "path": "frontend/src/components/Navbar.tsx",
          "operation": "modify",
          "description": "In the 'Book Now' button onClick handler, add window.scrollTo(0, 0) after navigate('/appointment') to ensure scroll-to-top behavior is applied immediately. Ensure all Link components in the navbar navigation do not interfere with the router-level scroll restoration added in App.tsx."
        }
      ]
    }
  ]
}